In [1]:
import pandas as pd
import numpy as np

In [7]:
iris_df=pd.read_csv("Iris_dataSet.csv")
print(iris_df)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
df1=iris_df.copy() # we are making the copy of the data so that we do not destroy original data

<bound method NDFrame.head of      sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]>

In [15]:
print(df1.head(4))
print(df1.tail(4))
print(df1.shape)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
     sepal_length  sepal_width  petal_length  petal_width    species
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica
(150, 5)

In [17]:
print(df1.iloc[0:3,0:2])

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

In [ ]:
#removing row in pandas data frame
df2=df1.copy()

df_new=df2.drop(1)
print(df_new.head(4))
#removing multiple rows at once
row_to_drop=[4,3,76]
df_new=df2.drop(index=row_to_drop)
print(df_new.head(5))

#removing in inplace
df2.drop(3,inplace=True)
print(df2.head(5))

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [37]:
# removing column in data frame
df_new1=df.copy()
df_new1.drop(columns="sepal_width",inplace=True)
print(df_new1.head(5))

#droping multiple columns at once 
col_to_drop=["sepal_length","petal_length"]
df_new1.drop(columns=col_to_drop,inplace=True)
print(df_new1.head(5))

   sepal_length  petal_length  petal_width species
0           5.1           1.4          0.2  setosa
1           4.9           1.4          0.2  setosa
2           4.7           1.3          0.2  setosa
3           4.6           1.5          0.2  setosa
4           5.0           1.4          0.2  setosa
   petal_width species
0          0.2  setosa
1          0.2  setosa
2          0.2  setosa
3          0.2  setosa
4          0.2  setosa

In [38]:
df2.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    149.000000   149.000000    149.000000   149.000000
mean       5.851678     3.053691      3.773826     1.205369
std        0.824507     0.435040      1.760543     0.761292
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.400000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [43]:
df3=df.copy()

print(df3[df3.species=="setosa"].describe())

df3[df3.sepal_width>3].describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

       sepal_length  sepal_width  petal_length  petal_width
count     67.000000    67.000000     67.000000    67.000000
mean       5.683582     3.426866      2.935821     0.905970
std        0.880702     0.301804      1.938814     0.888288
min        4.400000     3.100000      1.000000     0.100000
25%        5.000000     3.200000      1.500000     0.200000
50%        5.400000     3.400000      1.600000     0.400000
75%        6.400000     3.600000      5.000000     1.800000
max        7.900000     4.400000      6.700000     2.500000

In [45]:
# what if i want to add a new row 
print(df_new.head(10))

df_new.loc[3]=[4.2,1.8,0.2,"rose"]
df_new.loc[4]=[4.2,1.8,0.2,"lotus"]

    sepal_length  petal_length  petal_width species
0            5.1           1.4          0.2  setosa
1            4.9           1.4          0.2  setosa
2            4.7           1.3          0.2  setosa
5            5.4           1.7          0.4  setosa
6            4.6           1.4          0.3  setosa
7            5.0           1.5          0.2  setosa
8            4.4           1.4          0.2  setosa
9            4.9           1.5          0.1  setosa
10           5.4           1.5          0.2  setosa
11           4.8           1.6          0.2  setosa

In [ ]:
#lets see if it is added 
print(df_new.head())

print(df_new.tail())  # as you can see it is added in the bottom so how to sort this

   sepal_length  petal_length  petal_width species
0           5.1           1.4          0.2  setosa
1           4.9           1.4          0.2  setosa
2           4.7           1.3          0.2  setosa
5           5.4           1.7          0.4  setosa
6           4.6           1.4          0.3  setosa
     sepal_length  petal_length  petal_width    species
147           6.5           5.2          2.0  virginica
148           6.2           5.4          2.3  virginica
149           5.9           5.1          1.8  virginica
3             4.2           1.8          0.2       rose
4             4.2           1.8          0.2      lotus

In [48]:
df_new.reset_index(drop=True,inplace=True)
print(df.head())

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [50]:
#delete a column
del df_new1["petal_width"]

df_new1.describe()

       species
count      150
unique       3
top     setosa
freq        50

In [51]:
#adding a cloumn
df_new1["color"]="white"
df_new1.describe()

       species  color
count      150    150
unique       3      1
top     setosa  white
freq        50    150

In [53]:
# how to deal with nan or null value
# we do it by channging nan value either by filling it with mean median or mode value or deleting the whole row

df_new.head()

df_new.iloc[2:4,1:3]=np.nan

In [54]:
df_new.head()

   sepal_length  petal_length  petal_width species
0           5.1           1.4          0.2  setosa
1           4.9           1.4          0.2  setosa
2           4.7           NaN          NaN  setosa
3           5.4           NaN          NaN  setosa
4           4.6           1.4          0.3  setosa

In [58]:
# first we will drop all row containing nan value
df4=df_new.copy()
df4.dropna(inplace=True)
print(df4.head())
df4.reset_index(drop=True,inplace=True)
df4.head()

   sepal_length  petal_length  petal_width species
0           5.1           1.4          0.2  setosa
1           4.9           1.4          0.2  setosa
4           4.6           1.4          0.3  setosa
5           5.0           1.5          0.2  setosa
6           4.4           1.4          0.2  setosa

   sepal_length  petal_length  petal_width species
0           5.1           1.4          0.2  setosa
1           4.9           1.4          0.2  setosa
2           4.6           1.4          0.3  setosa
3           5.0           1.5          0.2  setosa
4           4.4           1.4          0.2  setosa

In [62]:
# now we will change this nan value to the mean of the petal_lenght or mean lenght of the setosa
df_new.fillna({'petal_length':df_new.petal_length.mean()},inplace=True)
df_new.head()

   sepal_length  petal_length  petal_width species
0           5.1      1.400000          0.2  setosa
1           4.9      1.400000          0.2  setosa
2           4.7      3.787075          NaN  setosa
3           5.4      3.787075          NaN  setosa
4           4.6      1.400000          0.3  setosa

In [73]:
# what we can do is we take the data of setosa and then change the nan value to mean of setosa
setosa_mean=df_new[df_new.species=="setosa"].petal_width.mean()
df_new.fillna({'petal_width':setosa_mean},inplace=True)
df_new.head()

   sepal_length  petal_length  petal_width species
0           5.1      1.400000     0.200000  setosa
1           4.9      1.400000     0.200000  setosa
2           4.7      3.787075     0.243478  setosa
3           5.4      3.787075     0.243478  setosa
4           4.6      1.400000     0.300000  setosa